import {ref} from 'vue';
import {defineStore} from "pinia";
import { api } from '@/helpers';
import {AxiosError} from "axios";


interface Level {
    id: number;
    created_at: string;
    updated_at: string;
    title: string;
    content: string;
    lesson: number;
}

interface Lesson {
    id: number;
    levels: Level[];
    created_at: string;
    updated_at: string;
    title: string;
    description: string;
}

export const useLessonStore = defineStore('lessonStore', () => {
    const loading = ref(false);
    const error = ref(null);
    const mockLessons = [
  {
    "id": 1,
    "levels": [
      {
        "id": 4,
        "created_at": "2024-09-06T10:38:05.246153+03:00",
        "updated_at": "2024-09-06T10:38:05.246153+03:00",
        "title": "Клавиши 1",
        "content": [
            "жвала ало фолада аллал овод лыжа",
            "жажда вад вожжов олово вала вывод",
            "дылда лафа додов лолла фал дада",
            "довод лава дож адов жвало авад",
            "ажа ода вод ада волоф аод",
            "лала адолф лада алаа фадал ооо",
            "водовод давыдов оао вылов влад ады",
            "лад авва алда фалда воды водла",
            "лола лал дважды алы вовд аж",
            "жвала ало фолада аллал овод лыжа"
        ],
        "lesson": 1
      },
      {
        "id": 5,
        "created_at": "2024-09-06T10:38:05.246153+03:00",
        "updated_at": "2024-09-06T10:38:05.246153+03:00",
        "title": "Клавиши 2",
        "content": [
            "вдыв ыдлд флвв дфыв",
            "фовы флжж лооа лддж",
            "жваа лафд жыфл аыоы",
            "вфыд вооы ыовл ладл",
            "жоыа лдвы ждаж ыфды",
            "фллф ыжва алад лвоа",
            "жыыа ажол джол жллв",
            "лввд флаы аоаа ыжды",
            "даоо фдда жвжо водо",
            "вфаф дфла ыажы ыава",
            "аоды офоо авво флва",
            "ффвы фжаа дждо аыда"
        ],
        "lesson": 1
      }
    ],
    "created_at": "2024-09-02T10:01:13.331148+03:00",
    "updated_at": "2024-09-06T10:38:05.245153+03:00",
    "title": "Урок 1",
    "description": ""
  },
  {
    "id": 2,
    "levels": [
      {
        "id": 1,
        "created_at": "2024-09-02T10:34:30.362122+03:00",
        "updated_at": "2024-09-06T10:45:12.165515+03:00",
        "title": "Уровень 1",
        "content": [
            "опор рада лора адыр поп рол под выпор джорджо лавр подвод арпа",
            "палоло подпар доллар поваров радар адып выдра водопровод дора джордж",
            "алваро пал арда парад орава прапор проплав пожар арад дар провар параф",
            "раджаф пола аджаро лорд пол подпора правда джаппар ровд плод жор фролово",
            "ваап жаров одра дрова выпал плодовод алвара владар поварово попов радж пыж"
        ],
        "lesson": 2
      },
        {
            "id": 2,
            "created_at": "2024-09-02T10:34:30.362122+03:00",
            "updated_at": "2024-09-06T10:45:12.165515+03:00",
            "title": "Уровень 2",
            "content": [
                "кк гг кк гг",
                "кг кг кг кг",
                "гк гк гк гк",
                "гкгк ккгг ккгк гкгк",
                "кгкк кгкг ккгк кггк",
                "кггк гкгг кггк кгкк",
                "выыд дкыг кака кокк",
                "ажгв ггдп гкко лыкг",
                "гкжк когк каык гкрд",
                "гкгк гккж пакг гкгк",
                "ыопп кырг гфра кдвы"
            ],
        },
        {
            "id": 3,
            "created_at": "2024-09-02T10:34:30.362122+03:00",
            "updated_at": "2024-09-06T10:45:12.165515+03:00",
            "title": "Уровень 3",
            "content": [
                "ажкр оыдф рггл гогг",
                "алкл лыад ыжда гкжд",
                "вгла двпв догд гжлд",
                "павг ковд кдор калж",
                "гкгп вкго ыдгг ыдды",
                "окар пффж дарг гыыл",
                "жгог гжлк вдгг кдпг",
                "гаак рвыж пкфа пфго",
                "вкок кдгп гыаг акпд",
                "вдлр рпва рфдж гдгп",
                "гдпк вждф гкга жждж",
                "кыгп пгыв ылог лфкк"
            ]
        },

    ],
    "created_at": "2024-09-02T10:34:30.362122+03:00",
    "updated_at": "2024-09-06T10:45:12.165515+03:00",
    "title": "Урок 2",
    "description": ""
  }
]
    const lessons = ref(mockLessons);
    async function fetchLessons() {
        loading.value = false;
        error.value = null;
        lessons.value = mockLessons;
    }
    return {
        lessons,
        loading,
        error,
        fetchLessons
    }
})